МойДипломРабочаяВерсия/src/Documents/ВКМ_Отпуска/ВКМ_Отпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_Отпуска</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отпуск</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияСотрудника</name>
      <type>
        <types>CatalogRef.ВКМ_КатегорииСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МойДипломРабочаяВерсия/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияСотрудника</name>
    <type>
      <types>CatalogRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

МойДипломРабочаяВерсия/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.РабочихДней</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияСотрудника</name>
    <type>
      <types>CatalogRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

МойДипломРабочаяВерсия/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <resources>
    <name>РабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочихЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МойДипломРабочаяВерсия/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Более28Дней</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МойДипломРабочаяВерсия/src/Documents/ВКМ_Отпуска/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Отпуск.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник.КатегорияСотрудника КАК КатегорияСотрудника
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Дата)); 
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Отпуск.Добавить();
			НоваяСтрока.Сотрудник = Выборка.Сотрудник;
			НоваяСтрока.КатегорияСотрудника = Выборка.КатегорияСотрудника;
			НоваяСтрока.ДатаНачала = Выборка.ДатаНачала;
			НоваяСтрока.ДатаОкончания = Выборка.ДатаОкончания;
		КонецЦикла;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("В этом месяце никто не идет в отпуск!");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура РассчитатьНаСервере()  

	Для Каждого Строка Из Объект.Отпуск Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ВКМ_ОсновныеНачисления.Сумма КАК Сумма,
		|	ВКМ_ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Сумма КАК Сумма1,
		|	ВКМ_ДополнительныеНачисления.Сумма + ВКМ_ОсновныеНачисления.Сумма КАК СуммаНачислений
		|ПОМЕСТИТЬ ВТ_Начисления
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_ОсновныеНачисления.Сотрудник
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.ГрафикРаботы,
		|	ВКМ_ОсновныеНачисления.Сумма,
		|	ВКМ_ОсновныеНачисления.ПериодРегистрации,
		|	ВКМ_ОсновныеНачисления.ВидРасчета,
		|	ВКМ_ОсновныеНачисления.Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Начисления.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТ_Начисления.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_Начисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ГрафикиРаботы.РабочихДней) КАК РабочихДней,
		|	&ДнейОтпуска КАК ДнейОтпуска,
		|	ЕСТЬNULL(ВТ_Начисления.СуммаНачислений, 0) КАК СуммаВсехНачислений
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикиРаботы КАК ВКМ_ГрафикиРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Начисления КАК ВТ_Начисления
		|		ПО (ВТ_Начисления.ГрафикРаботы = ВКМ_ГрафикиРаботы.ГрафикРаботы)
		|ГДЕ
		|	ВКМ_ГрафикиРаботы.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВТ_Начисления.Сотрудник = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Начисления.ГрафикРаботы,
		|	ВТ_Начисления.ПериодРегистрации,
		|	ВТ_Начисления.Сотрудник,
		|	ЕСТЬNULL(ВТ_Начисления.СуммаНачислений, 0)";
		
		КоличествоМесяцев = 12;
		КонецПериода = Строка.ДатаОкончания - (60 * 60 * 24);
		НачалоПериода = ДобавитьМесяц(Строка.ДатаНачала, - КоличествоМесяцев);
		ДнейОтпуска = (НачалоДня(Строка.ДатаОкончания) - НачалоДня(Строка.ДатаНачала)) / (60 * 60 * 24);
		
		Запрос.УстановитьПараметр("Сотрудник", Строка.Сотрудник);
		Запрос.УстановитьПараметр("ДнейОтпуска", ДнейОтпуска);
		Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			//Если Выборка.РабочихДней <> 0 Тогда
				Строка.Сумма = Выборка.СуммаВсехНачислений / Выборка.РабочихДней * ДнейОтпуска;
			//Иначе
			//	Строка.Сумма = 0;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры


#КонецОбласти
